goal_setter/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])